{"path":"alternatives","templateID":2,"sharedPropsHashes":{},"localProps":{"alternativesMarkdown":"# Alternatives\n\nThere are many other Material Design component libraries out there. In this guide, we will\ncompare Materialish to a select number of these other options.\n\nBefore we begin, it's important to recognize that Materialish is intended to represent Netflix's\ninternal design language, and not Material Design. Any library that is intended to\nbe a direct implementation of Material requires extra tweaks to align it with the Netflix styleguide.\n\nThis may not matter to you if you do not work at Netflix, but if you do, then you should\nconsider the cost of theming the options below when making a decision on which component library to use.\n\nIf you do not work at Netflix, then Materialish may not be right for you on account of the\nmisalignment between the Material style guide and the Materialish style guide, unless you happen to prefer the\nchanges.\n\n## [React Toolbox](http://react-toolbox.io/#/)\n\nThere are a few main differences between React Toolbox and Materialish:\n\n- React Toolbox is committed to providing powerful theming and customization\n- Their theming system is more opinionated about how you integrate it with your application\n- As a consequence of the above, we believe it is more complicated to integrate React Toolbox into your application\n- React Toolbox provides interaction components as well as visual components, whereas Materialish\n  is primarily focused on visual components. For instance, their Dialog comes with positioning and animations,\n  while the Materialish Dialog provides just the visuals.\n\nBoth Materialish and React Toolbox provide a similar number, but a different overall set, of components. In summary,\nMaterialish could be considered a simpler-to-use, but less flexible set of components compared to React Toolbox.\n\n## [Material UI](https://material-ui.com/api/avatar/)\n\nMaterial UI provides a large number of components (at the time of writing, nearly four times as many components as Materialish).\nKey differences between the implementations are:\n\n- Material UI provides a complicated and powerful [customization/theming system](https://material-ui.com/customization/overrides/) that\n  allows you to control how the components appear. This is not a design goal of Materialish\n- Material UI uses CSS-in-JS under-the-hood. This makes it simpler to import components, as they inject their own styles. The authors of Material UI\n  do not necessarily intend for everyone to use the CSS-in-JS API, it is [made available to you](https://material-ui.com/customization/css-in-js/)\n  should you need it. In contrast, Materialish uses \"regular\" CSS for styles, including CSS Variables.\n- Material UI includes interaction components as well as visual components. For instance, their Dialog manages positioning for you.\n\nIf your project requires a larger number of components than what Materialish provides, or if you prefer a CSS-in-JS API, then Material UI may be\na better choice for you.\n"}}
